labapart/polymcu/Device/Nordic/nRF5_SDK/components/nfc/experimental_t4t_lib/hal_t4t/hal_nfc_t4t.c
        NRF_NFCT->SELRES =
            (sel_res << NFCT_SELRES_PROTOCOL_Pos) & NFCT_SELRES_PROTOCOL_Msk;
    }
    else
    {
        /* No implementation needed */
    }

    return NRF_SUCCESS;
}


/* This function is used by nfc_lib for unit testing only */
ret_code_t hal_nfc_parameter_get(hal_nfc_param_id_t id, void * p_data, size_t * p_max_data_length)
{
    if (*p_max_data_length < 1)
    {
        *p_max_data_length = 1;
        return NRF_ERROR_DATA_SIZE;
    }

    if (id == HAL_NFC_PARAM_FWI)
    {
        *((uint8_t *) p_data) = m_fwi;
        *p_max_data_length    = sizeof(m_fwi);
    }
    else if (id == HAL_NFC_PARAM_SELRES)
    {
        /* Update SEL_RES 'Protocol' bits setting */
        uint8_t sel_res       = (NRF_NFCT->SELRES & NFCT_SELRES_PROTOCOL_Msk) >>
                                NFCT_SELRES_PROTOCOL_Pos;
        *((uint8_t *) p_data) = sel_res;
        *p_max_data_length    = sizeof(sel_res);
    }
    else
    {
        /* No implementation needed */
    }

    return NRF_SUCCESS;
}


ret_code_t hal_nfc_start(void)
{
    NRF_NFCT->ERRORSTATUS = NRF_NFCT_ERRORSTATUS_ALL;

    NVIC_ClearPendingIRQ(NFCT_IRQn);
    NVIC_SetPriority(NFCT_IRQn, APP_IRQ_PRIORITY_LOW);
    NVIC_EnableIRQ(NFCT_IRQn);

    NRF_NFCT->TASKS_SENSE = 1;

    NRF_LOG_INFO("Start\r\n");
    return NRF_SUCCESS;
}


ret_code_t hal_nfc_send(const uint8_t * p_data, size_t data_length)
{
    if (data_length == 0)
    {
        return NRF_ERROR_DATA_SIZE;
    }

    if(m_swtx_sent)
    {
        m_pending_msg_ptr     = p_data;
        m_pending_data_length = data_length;
        m_pending_msg         = true;

        NRF_LOG_DEBUG("Pending message.\r\n");
        return NRF_SUCCESS;
    }

    m_t4t_tx_waiting   = false;

    /* Ignore previous TX END events, SW takes care only for data frames which tranmission is triggered in this function */
    nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMEEND);

    NRF_NFCT->INTENSET       = (NFCT_INTENSET_TXFRAMEEND_Enabled << NFCT_INTENSET_TXFRAMEEND_Pos); //Moved to the end in T4T to avoid delaying TASKS_STARTX
    NRF_NFCT->PACKETPTR      = (uint32_t) p_data;
    NRF_NFCT->TXD.AMOUNT     = (data_length << NFCT_TXD_AMOUNT_TXDATABYTES_Pos) &
                                NFCT_TXD_AMOUNT_TXDATABYTES_Msk;
    NRF_NFCT->FRAMEDELAYMODE = NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_WindowGrid << 
                               NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos;
    NRF_NFCT->TASKS_STARTTX  = 1;

    NRF_LOG_INFO("Send\r\n");
    return NRF_SUCCESS;
}


ret_code_t hal_nfc_stop(void)
{
    NRF_NFCT->TASKS_DISABLE = 1;

    NRF_LOG_INFO("Stop\r\n");
    return NRF_SUCCESS;
}


ret_code_t hal_nfc_done(void)
{
    m_nfc_lib_callback = (hal_nfc_callback_t) NULL;

    return NRF_SUCCESS;
}


void NFCT_IRQHandler(void)
{
    nfct_field_sense_state_t current_field = NFC_FIELD_STATE_NONE;

    HAL_NFC_DEBUG_PIN_SET(HAL_NFC_NFC_EVENT_DEBUG_PIN); // DEBUG!

    if (NRF_NFCT->EVENTS_FIELDDETECTED && (NRF_NFCT->INTEN & NFCT_INTEN_FIELDDETECTED_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_FIELDDETECTED);
        HAL_NFC_DEBUG_PIN_SET(HAL_NFC_DETECT_EVENT_DEBUG_PIN); // DEBUG!
        current_field = NFC_FIELD_STATE_ON;
        HAL_NFC_DEBUG_PIN_CLEAR(HAL_NFC_DETECT_EVENT_DEBUG_PIN); // DEBUG!

        NRF_LOG_DEBUG("Field detected\r\n");
    }

#ifndef HAL_NFC_ENGINEERING_BC_FTPAN_WORKAROUND
    if (NRF_NFCT->EVENTS_FIELDLOST && (NRF_NFCT->INTEN & NFCT_INTEN_FIELDLOST_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_FIELDLOST);
        current_field =
           (current_field == NFC_FIELD_STATE_NONE) ? NFC_FIELD_STATE_OFF : NFC_FIELD_STATE_UNKNOWN;

        NRF_LOG_DEBUG("Field lost\r\n");
    }
#endif // HAL_NFC_ENGINEERING_BC_FTPAN_WORKAROUND

    /* Perform actions if any FIELD event is active */
    if (current_field != NFC_FIELD_STATE_NONE)
    {
        nrf_nfct_field_event_handler(current_field);
    }

    if (NRF_NFCT->EVENTS_RXFRAMEEND && (NRF_NFCT->INTEN & NFCT_INTEN_RXFRAMEEND_Msk))
    {
        /* Take into account only number of whole bytes */
        uint32_t rx_data_size = ((NRF_NFCT->RXD.AMOUNT & NFCT_RXD_AMOUNT_RXDATABYTES_Msk) >>
                                 NFCT_RXD_AMOUNT_RXDATABYTES_Pos) - NFC_CRC_SIZE;
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_RXFRAMEEND);

        /* Look for Tag 4 Type Commands */
        if (m_nfc_rx_buffer[0] == NFC_T4T_RATS_CMD)
        {
            /* Disable Auto Collision Resolution */
            NRF_NFCT_AUTOCOLRESCONFIG = NRF_NFCT_AUTOCOLRESCONFIG |
                                        (1u << NRF_NFCT_AUTOCOLRESCONFIG_Pos);
            NRF_LOG_DEBUG("RX: T4T Activate\r\n");
        }
        else if (m_nfc_rx_buffer[0] == NFC_T4T_S_DESELECT)
        {
            m_deselect = true;
            NRF_LOG_DEBUG("RX: T4T Go to sleep\r\n");
        }
        else if (m_swtx_sent && m_nfc_rx_buffer[0] == NFC_T4T_S_WTX)
        {
            m_swtx_sent = false;
            
            NRF_LOG_DEBUG("RX: S(WTX) reponse\r\n");
            
            if(m_pending_msg)
            {
                m_pending_msg = false;

                nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMEEND);

                NRF_NFCT->INTENSET       = (NFCT_INTENSET_TXFRAMEEND_Enabled << NFCT_INTENSET_TXFRAMEEND_Pos);
                NRF_NFCT->PACKETPTR      = (uint32_t) m_pending_msg_ptr;
                NRF_NFCT->TXD.AMOUNT     = (m_pending_data_length << NFCT_TXD_AMOUNT_TXDATABYTES_Pos) &
                                            NFCT_TXD_AMOUNT_TXDATABYTES_Msk;
                NRF_NFCT->FRAMEDELAYMODE = NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_WindowGrid << 
                                            NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos;
                NRF_NFCT->TASKS_STARTTX  = 1;

                m_t4t_tx_waiting   = false;
                NRF_LOG_DEBUG("Sending pending message!\r\n");
            }
        }
        else if ((m_nfc_rx_buffer[0] & NFC_T4T_BLOCK_MSK) == NFC_T4T_I_BLOCK)
        {
            /* Set up default transmission of S(WTX) block. Tx will be executed only if FDT timer expires (FrameDelayMode-ExactVal) before
             * hal_nfc_send is called */
            m_wtx_data[0]            = NFC_T4T_S_WTX;
            m_wtx_data[1]            = NFC_T4T_WTXM_MAX;
            NRF_NFCT->PACKETPTR      = (uint32_t) m_wtx_data;
            NRF_NFCT->TXD.AMOUNT     = (sizeof(m_wtx_data) << NFCT_TXD_AMOUNT_TXDATABYTES_Pos) &
                                       NFCT_TXD_AMOUNT_TXDATABYTES_Msk;
            NRF_NFCT->FRAMEDELAYMODE = NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_ExactVal << 
                                       NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos;
            NRF_NFCT->TASKS_STARTTX  = 1;
            m_t4t_tx_waiting         = true;

            NRF_NFCT->INTENSET = (NFCT_INTENSET_TXFRAMEEND_Enabled << NFCT_INTENSET_TXFRAMEEND_Pos);
        }
        else
        {
            /* Indicate that SLP_REQ was received - this will cause FRAMEDELAYTIMEOUT error */
            if (m_nfc_rx_buffer[0] == NFC_SLP_REQ_CMD)
            {
                m_slp_req_received = true;
                NRF_NFCT->INTENCLR = NFCT_INTENCLR_RXFRAMEEND_Clear << NFCT_INTENCLR_RXFRAMEEND_Pos; // disable RX here (will enable at SELECTED)
            }
            /* Not a READ Command, so wait for next frame reception */
            NRF_NFCT->TASKS_ENABLERXDATA = 1;
        }

        if (m_nfc_lib_callback != NULL)
        {
            /* This callback should trigger transmission of READ Response */
            m_nfc_lib_callback(m_nfc_lib_context,
                               HAL_NFC_EVENT_DATA_RECEIVED,
                               (void *)m_nfc_rx_buffer,
                               rx_data_size);
        }
        /* Clear TXFRAMESTART EVENT so it can be checked in hal_nfc_send */
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMESTART);
        NRF_LOG_DEBUG("Rx fend\r\n");
    }

    if (NRF_NFCT->EVENTS_TXFRAMEEND && (NRF_NFCT->INTEN & NFCT_INTEN_TXFRAMEEND_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMEEND);

        /* Disable TX END event to ignore frame transmission other than READ response */
        NRF_NFCT->INTENCLR = (NFCT_INTENCLR_TXFRAMEEND_Clear << NFCT_INTENCLR_TXFRAMEEND_Pos);

        if (m_deselect)
        {
            /* Re-enable Auto Collision Resolution */
            NRF_NFCT_AUTOCOLRESCONFIG = NRF_NFCT_AUTOCOLRESCONFIG &
                                        ~(1u << NRF_NFCT_AUTOCOLRESCONFIG_Pos);
            NRF_NFCT->TASKS_GOSLEEP   = 1;
            /* Disable RX here (will be enabled at SELECTED) */
            NRF_NFCT->INTENCLR        = NFCT_INTENCLR_RXFRAMEEND_Clear <<
                                        NFCT_INTENCLR_RXFRAMEEND_Pos;
            m_deselect = false;
        }
        else
        {
            /* Set up for reception */
            NRF_NFCT->PACKETPTR          = (uint32_t) m_nfc_rx_buffer;
            NRF_NFCT->MAXLEN             = NFC_RX_BUFFER_SIZE;
            NRF_NFCT->TASKS_ENABLERXDATA = 1;
            NRF_NFCT->INTENSET           =
                        (NFCT_INTENSET_RXFRAMEEND_Enabled << NFCT_INTENSET_RXFRAMEEND_Pos) |
                        (NFCT_INTENSET_RXERROR_Enabled    << NFCT_INTENSET_RXERROR_Pos);
        }

        if (m_nfc_lib_callback != NULL)
        {
            m_nfc_lib_callback(m_nfc_lib_context, HAL_NFC_EVENT_DATA_TRANSMITTED, 0, 0);
        }

